{
    "title": "Comprehensive FDIC Public Data on U.S. Bank Institutions and Failures",
    "subtitle": "This data set contains the fdic public data on fdic institutions.",
    "description": "Title: Comprehensive FDIC Public Data on U.S. Bank Institutions and Failures\n## Short Description\nA rich dataset that provides detailed information about FDIC-insured bank institutions, their locations, and historical bank failures in the United States from 1934 to present.\n## Long Description\n#### Overview\nThis dataset is compiled from public data provided by the Federal Deposit Insurance Corporation (FDIC). It offers a comprehensive look at FDIC-insured banking institutions, their various events, locations, and a historical account of bank failures in the United States from 1934 to the present day.\n#### Data Files\n- bank_failures.csv: This file contains detailed information on historical bank failures from 1934 to the present.\n- failure_properties.csv: This file contains the property definitions from the failures api.\n- events_definitions.csv: This is a definition file that explains the various events related to bank institutions.\n- institutions.csv: This file provides comprehensive data on all FDIC-insured institutions.\n- institutions_definitions.csv: This is a definition file that elaborates on the terms and fields used in the institutions.csv file.\n- locations.csv: This file gives you the geographical locations of all FDIC-insured institutions.\n- locations_definitions.csv: This is a definition file that explains the terms and fields used in the locations.csv file.\n#### Potential Use-Cases\n- Risk Assessment: Evaluate the risk factors associated with various banks.\n- Historical Analysis: Perform a time-series analysis on bank failures.\n- Geographical Insights: Investigate the distribution of bank institutions across different states or regions.\n- Regulatory Compliance: Monitor banks that are FDIC insured for compliance with federal laws.\n#### Update Schedule\nThis dataset is updated daily to reflect the most current data available from the FDIC.\n#### Reporting Issues\nIf you encounter any issues or discrepancies with the dataset, please report them at our GitHub Issues Page.\n#### Data Source\nAll data is sourced from the Federal Deposit Insurance Corporation (FDIC).\n#### Licensing\nThis dataset is made available under the Public Domain. Please attribute the source when using this data.\n#### Acknowledgements\nWe would like to thank the FDIC for making this data publicly available.",
    "id": "ronmallory/fdic-failed-bank-dataset",
    "licenses": [
        {
            "name": "apache-2.0"
        }
    ],
    "keywords": [
        "beginner"
    ],
    "annotations": {
        "maintainer": "Ron Mallory",
        "source": "https://banks.data.fdic.gov/api/"

    },
    "resources": [
        {
            "path": "bank_failures.csv",
            "description": "Get detail on historical bank failures from 1934 to present."
        },
        {
            "path": "events_definitions.csv",
            "description": "CSV definition file for bank events"
        },
        {
            "path": "institutions.csv",
            "description": "Get detail on all FDIC-insured institutions."
        },
        {
            "path": "institutions_definitions.csv",
            "description": "CSV definition file for bank institutions"
        },
        {
            "path": "locations.csv",
            "description": "Get location details on all FDIC-insured institutions."
        },
        {
            "path": "locations_definitions.csv",
            "description": "CSV definition file for bank locations"
        },
        {
            "path": "failure_properties.csv",
            "description": "/failures api definitions file converted from yaml to csv."
        }
    ]
}
